
/*======================================================
	@ brief :	宏函数，以字符串的形式进行的加法运算，结
	果放在串X中
	@ example:	("123","2") -> "125"
	@ parama:	
				X -> 被加数的串
				Y -> 加数的串
	@ retval:	X -> 返回原指针
======================================================*/
//#define StrAdd(X,Y) reverse_str(BCD2str(BCD_Add(str2BCD(reverse_str(X)), str2BCD(reverse_str(Y)))))
/*======================================================
	@ brief :	宏函数，以字符串的形式进行的乘法运算，结
	果放在串X中
	@ example:	("123","2") -> "125"
	@ parama:
				X -> 被加数的串
				Y -> 加数的串
	@ retval:	X -> 返回原指针
======================================================*/
#define StrMul(X,Y) reverse_str(BCD2str(BCD_Mul(str2BCD(reverse_str(X)), str2BCD(reverse_str(Y)))))
/*======================================================
	@ brief :	宏函数，以整形的形式进行的加法运算并转
	化为字符串，放在X中
	@ example:	(123,2) -> "125"
	@ parama:
				X -> 待处理串的指针
	@ retval:	X -> 处理后返回原指针
======================================================*/
//#define 
